export type BackgroundColorMap = {
  [key: string]: string;
};


export const backgroundColor: BackgroundColorMap =  {
    'Ширпотреб': "rgba(230,234,248,0.3)",
    'Consumer': "rgba(230,234,248,0.3)",
    'Базов': "rgba(230,234,248,0.3)",
    'Base': "rgba(230,234,248,0.3)",
    'Промышленное качество': "rgba(100,150,225,0.3)",
    'Industrial': "rgba(100,150,225,0.3)",
    'Армейское качество': "rgba(75,105,255,0.3)",
    'Mil-Spec': "rgba(75,105,225,0.3)",
    'Заслуженный': "rgba(75,105,225,0.3)",
    'Высшего': "rgba(75,105,225,0.3)",
    'High': "rgba(75,105,225,0.3)",
    'Distinguished':"rgba(75,105,225,0.3)",
    'Restricted': "rgba(136,71,255,0.3)",
    'Exceptional': "rgba(136,71,255,0.3)",
    'Remarkable': "rgba(136,71,255,0.3)",
    'Запрещённое': "rgba(136,71,255,0.3)",
    'Примечательн': "rgba(136,71,255,0.3)",
    'Исключительный': "rgba(136,71,255,0.3)", 
    'Засекреченное': "rgba(212,43,230,0.3)",
    'Экзотичн': "rgba(212,43,230,0.3)",
    'Превосходный': "rgba(212,43,230,0.3)",
    'Classified': "rgba(212,43,230,0.3)",
    'Superior': "rgba(212,43,230,0.3)",
    'Exotic': "rgba(212,43,230,0.3)",
    'Тайное': "rgba(235,75,75,0.3)",
    'Мастерский': "rgba(235,75,75,0.3)",
    'Экстраординарн': "rgba(235,75,75,0.3)", 
    'Covert': "rgba(235,75,75,0.3)", 
    'Extraordinary': "rgba(235,75,75,0.3)", 
    'Master': "rgba(235,75,75,0.3)",
  }